tap "heroku/brew"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "microsoft/mssql-release"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "thezoraiz/ascii-image-converter"
tap "threedotslabs/tap"
# Code searching, linting, rewriting
brew "ast-grep"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Static analysis of C and C++ code
brew "cppcheck"
# .NET Core
brew "dotnet@8"
# Generate documentation for several programming languages
brew "doxygen"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Fast linters runner for Go
brew "golangci-lint"
# Apply a diff file to an original
brew "gpatch"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Lazier way to manage everything docker
brew "lazydocker"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Modern programming language in the Lisp/Scheme family
brew "minimal-racket"
# MMDB file management CLI supporting various operations on MMDB database files
brew "mmdbctl"
# QUIC transport protocol implementation
brew "mvfst"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Development kit for the Java programming language
brew "openjdk"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17", restart_service: :changed
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Command-line toolbox for fancy output in the terminal
brew "rich-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Simple terminal image viewer written in Rust
brew "viu"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.4"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# This is the tdl CLI tool used for running the interactive trainings on the https://academy.threedots.tech/
brew "threedotslabs/tap/tdl"
# Enable Windows-like alt-tab
cask "alt-tab"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Reimagine your terminal
cask "fig"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Custom Discord client
cask "legcord"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Rust-based terminal
cask "warp"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anysphere.pyright"
vscode "appland.appmap"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.powershell"
vscode "naumovs.color-highlight"
vscode "oxc.oxc-vscode"
vscode "ritwickdey.liveserver"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
